# Этап 1: Сборка зависимостей
# Используем официальный образ Python. Указание версии гарантирует консистентность.
FROM python:3.11-slim as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Устанавливаем Poetry
RUN pip install poetry

# Копируем файлы с зависимостями в контейнер
COPY pyproject.toml poetry.lock ./

# Устанавливаем зависимости, не включая dev-зависимости, и создаем .venv
RUN poetry install --no-dev --no-root


# Этап 2: Финальный образ
# Используем тот же базовый образ для уменьшения размера финального образа
FROM python:3.11-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем виртуальное окружение, созданное на предыдущем этапе
COPY --from=builder /app/.venv ./.venv

# Активируем виртуальное окружение для всех последующих команд
ENV PATH="/app/.venv/bin:$PATH"

# Копируем исходный код нашего приложения
COPY ./src/torgovik ./src/torgovik

# Указываем команду, которая будет выполняться при запуске контейнера
# Запускаем uvicorn, чтобы он был доступен извне контейнера (host 0.0.0.0)
CMD ["uvicorn", "src.torgovik.main:app", "--host", "0.0.0.0", "--port", "8000"]